[
 {
  "desctiption": "\n\n\n"
 },
 {
  "desctiption": "World of Warcraft (WoW) is a massively multiplayer online role-playing game (MMORPG) released in 2004 by Blizzard Entertainment. Set in the Warcraft fantasy universe, World of Warcraft takes place within the world of Azeroth, approximately four years after the events of the previous game in the series, Warcraft III: The Frozen Throne.[3] The game was announced in 2001, and was released for the 10th anniversary of the Warcraft franchise on November 23, 2004. Since launch, World of Warcraft has had eight major expansion packs: The Burning Crusade (2007), Wrath of the Lich King (2008), Cataclysm (2010), Mists of Pandaria (2012), Warlords of Draenor (2014), Legion (2016), Battle for Azeroth (2018), and Shadowlands (2020).\n"
 },
 {
  "desctiption": "Similar to other MMORPGs, the game allows players to create a character avatar and explore an open game world in third- or first-person view, exploring the landscape, fighting various monsters, completing quests, and interacting with non-player characters (NPCs) or other players. The game encourages players to work together to complete quests, enter dungeons and engage in player versus player (PvP) combat, however the game can also be played solo without interacting with others. The game primarily focuses on character progression, in which players earn experience points to level up their character to make them more powerful and buy and sell items using in-game currency to acquire better equipment, among other game systems.\n"
 },
 {
  "desctiption": "World of Warcraft was a major critical and commercial success upon its original release in 2004 and quickly became the most popular MMORPG of all-time, reaching a peak of 12 million subscribers in 2010.[4] The game had over one hundred million registered accounts by 2014[5] and by 2017, had grossed over $9.23 billion in revenue, making it one of the highest-grossing video game franchises of all time. The game has been cited by gaming journalists as the greatest MMORPG of all-time and one of the greatest video games of all time and has also been noted for its long lifespan, continuing to receive developer support and expansion packs over 15 years since its initial release.[6][7][8] In 2019, a vanilla version of the game titled World of Warcraft Classic was launched, allowing players to experience the base game before any of its expansions launched.[9][10]\n"
 },
 {
  "desctiption": "As with other MMORPGs, players control a character avatar within a game world in third- or first-person view, exploring the landscape, fighting various monsters, completing quests, and interacting with non-player characters (NPCs) or other players. Also similar to other MMORPGs, World of Warcraft requires the player to pay for a subscription by using a credit or debit card, using prepaid Blizzard game cards or using a WoW Token purchased in-game. Players without a subscription may use a trial account that lets the player character reach up to level 20 but has many features locked.[11]\n"
 },
 {
  "desctiption": "To enter the game, the player must select a server, referred to in-game as a 'realm'. Each realm acts as an individual copy of the game world and falls into one of two categories. Available realms types are:\n"
 },
 {
  "desctiption": "Before the introduction of World of Warcraft's seventh expansion \"Battle for Azeroth\", both \"Normal\" and \"RP\" servers were each divided into two separate categories: PvE servers and PvP servers. This has since been removed after the implementation of the \"War Mode\" option, which allows any player (of level 20 and higher) on any server to determine whether they want to actively participate in PvP combat or not, by enabling War Mode in two of the game's capital cities.\n"
 },
 {
  "desctiption": "Realms are also categorized by language, with in-game support in the language available.[12]\n"
 },
 {
  "desctiption": "Players can make new characters on all realms within the region, and it is also possible to move already established characters between realms for a fee.[13]\n"
 },
 {
  "desctiption": "To create a new character, in keeping with the storyline of previous Warcraft games, players must choose between the opposing factions of the Alliance or the Horde; Pandaren, which were added in Mists of Pandaria, do not commit to a faction until after the starting zone is completed. Characters from the opposing factions can perform rudimentary communication (most often just \"emotes\"), but only members of the same faction can speak, mail, group and join guilds. The player selects the new character's race, such as orcs or trolls for the Horde, or humans or dwarves for the Alliance.[14] Players must select the class for the character, with choices such as mages, warriors, and priests available.[15] Most classes are limited to particular races.\n"
 },
 {
  "desctiption": "As characters become more developed, they gain various talents and skills, requiring the player to further define the abilities of that character.[16] Characters can choose two primary professions that can focus on producing items, such as tailoring, blacksmithing or jewelcrafting or on gathering from resource nodes, such as skinning or mining. Characters can learn all three secondary skills: archeology, cooking, and fishing.[17][18] Characters may form and join guilds, allowing characters within the guild access to the guild's chat channel, the guild name and optionally allowing other features, including a guild tabard, guild bank, guild repairs, and dues.[19]\n"
 },
 {
  "desctiption": "Much of World of Warcraft play involves the completion of quests. These quests are usually available from NPCs.[20] Quests usually reward the player with some combination of experience points, items, and in-game money. Quests allow characters to gain access to new skills and abilities, as well as the ability to explore new areas.[21] It is through quests that much of the game's story is told, both through the quest's text and through scripted NPC actions.[22] Quests are linked by a common theme, with each consecutive quest triggered by the completion of the previous, forming a quest chain. Quests commonly involve killing a number of creatures, gathering a certain number of resources, finding a difficult to locate object, speaking to various NPCs, visiting specific locations, interacting with objects in the world, or delivering an item from one place to another to acquire experience and treasures.\n"
 },
 {
  "desctiption": "While a character can be played on its own, players can group with others to tackle more challenging content. Most end-game challenges are designed in such a way that they can only be overcome while in a group. In this way, character classes are used in specific roles within a group.[20][23] World of Warcraft uses a \"rested bonus\" system, increasing the rate that a character can gain experience points after the player has spent time away from the game.[16] When a character dies, it becomes a ghost—or wisp for Night Elf characters—at a nearby graveyard.[21] Characters can be resurrected by other characters that have the ability or can self-resurrect by moving from the graveyard to the place where they died. If a character is past level ten and they resurrect at a graveyard, the items equipped by the character degrade, requiring in-game money and a specialist NPC to repair them. Items that have degraded heavily become unusable until they are repaired. If the location of the character's body is unreachable, they can use a special \"spirit healer\" NPC to resurrect at the graveyard. When the spirit healer revives a character, items equipped by the character at that time are further degraded, and the character is significantly weakened by what is in-game called \"resurrection sickness\" for up to ten minutes, depending on the character's level. This \"resurrection sickness\" does not occur and item degradation is less severe if the character revives by locating its body, or is resurrected by another player through spells or special items.[24][25]\n"
 },
 {
  "desctiption": "World of Warcraft contains a variety of mechanisms for player versus player (PvP) play. Players on player versus environment (PvE) servers can opt to \"flag\" themselves, making themselves attackable to players of the opposite faction.[26] Depending on the mode of the realm, PvP combat between members of opposing factions is possible at almost any time or location in the game world—the only exception being the starting zones, where the PvP \"flag\" must be enabled by the player wishing to fight against players of the opposite faction. PvE (called normal or RP) servers, by contrast, allow a player to choose whether or not to engage in combat against other players. On both server types, there are special areas of the world where free-for-all combat is permitted. Battlegrounds, for example, are similar to dungeons: only a set number of characters can enter a single battleground, but additional copies of the battleground can be made to accommodate additional players.[27] Each battleground has a set objective, such as capturing a flag or defeating an opposing general, that must be completed to win the battleground. Competing in battlegrounds rewards the character with tokens and honor points that can be used to buy armor, weapons, and other general items that can aid a player in many areas of the game. Winning a battleground awards more honor and tokens than losing. In addition, players also earn honor when they or nearby teammates kill players in a battleground.[26]\n"
 },
 {
  "desctiption": "World of Warcraft is set in the same universe as the Warcraft series of real-time strategy games and has a similar art direction.[11] World of Warcraft contains elements from fantasy, steampunk, and science fiction, including gryphons, dragons, elves, steam-powered automata, zombies, werewolves, other horror monsters, time travel, spaceships, and alien worlds.\n"
 },
 {
  "desctiption": "World of Warcraft takes place in a 3D representation of the Warcraft universe that players can interact with through their characters. The game world initially consisted of the two continents in Azeroth: Kalimdor and the Eastern Kingdoms. Four separate expansions later added to the game's playable area the realms of Outland and Draenor and the continents of Northrend and Pandaria. As a player explores new locations, different routes and means of transportation become available. Players can access \"flight masters\" in newly discovered locations to fly to previously discovered locations in other parts of the world.[28] Players can also use boats, zeppelins, or portals to move from one continent to another. Although the game world remains relatively similar from day to day, seasonal events reflecting real world events, such as Halloween (Hallow's End),[29] Christmas (Winter Veil), Children's Week,[26] Easter (Noblegarden), and Midsummer have been represented in the game world. Locations also have variable weather including, among other things, rain, snow, and dust storms.[28]\n"
 },
 {
  "desctiption": "A number of facilities are available for characters while in towns and cities. In each major city, characters can access a bank to deposit items, such as treasure or crafted items. Each character has access to personal bank storage with the option to purchase additional storage space using in-game gold.[30] Additionally, guild banks are available for use by members of a guild with restrictions being set by the guild leader.[31] Auction houses are available for players to buy and sell items to others in a similar way to online auction sites such as eBay.[32] Players can use mailboxes, which can be found in almost every town. Mailboxes are used to collect items won at auction, and to send messages, items, and in-game money to other characters.[16]\n"
 },
 {
  "desctiption": "Some of the challenges in World of Warcraft require players to group together to complete them. These usually take place in dungeons—also known as \"instances\"—that a group of characters can enter together. The term \"instance\" comes from each group or party having a separate copy, or instance, of the dungeon, complete with their own enemies to defeat and their own treasure or rewards.[33] This allows a group to explore areas and complete quests without others interfering. Dungeons are spread over the game world and are designed for characters of varying progression. A typical dungeon will allow up to five characters to enter as part of a group. Some dungeons require more players to group together and form a \"raid\" of up to forty players to face some of the most difficult challenges.[34] As well as dungeon-based raid challenges, several creatures exist in the normal game environment that are designed for raids to attack.[29][35]\n"
 },
 {
  "desctiption": "World of Warcraft requires a subscription to allow continued play, with options to pay in one-month, three-month, or six-month blocks, and time cards of varying lengths available from retailers, or purchasing a \"WoW Token\" in-game.[36][37] Expansion packs are available online and from retailers. As the game client is the same regardless of the version of World of Warcraft the user owns, the option to purchase expansions online was added as it allows for a quick upgrade. World of Warcraft is also available as a free Starter Edition, which is free to play for an unlimited amount of time. Starter Edition characters are unable to gain experience after reaching level 20, and there are other restrictions in effect for Starter Edition accounts, including the inability to trade, use mail, use Auction House, use public chat channels, join guilds or amass more than ten gold.[38]\n"
 },
 {
  "desctiption": "In January 2015, accounts that have lapsed subscriptions, which previously would not let a player log in, work like a restricted Starter Edition account with the one difference that sub-level 20 characters will be able to join a guild if any of your other characters are still in that guild.[39]\n"
 },
 {
  "desctiption": "In April 2015, an alternate way to cover the subscription was introduced. A player may spend real money ($20 in North America and differing amounts in other regions) on a WoW Token, which is sold on the auction house for in-game gold that initially could only be used to add 30 days of playtime.[37] At the launch of the feature in NA, a token sold for 30k gold and 24 hours later sold for 20k gold, therefore the gold amount changes depending on what players are willing to spend and the supply. Subsequently, the amount that an NA token sells for remained selling at above 30,000 gold and the other Battle.net regions are well above that value. Once a player buys a token on the auction house, it is account bound and cannot be resold. As of February 2017, the WoW Token can also be exchanged for $15 in Battle.net balance that can be used as credit for purchases in most of Blizzard's games as well as in Destiny 2.[40]\n"
 },
 {
  "desctiption": "The company offers parental controls[41] that allow various limits to be set on playing time. It is possible to set a daily limit, a weekly limit, or to specify an allowed playing schedule. In order to control these settings, it is necessary to log in with different credentials than are used just to enter the game. It is also possible to receive statistics on the time spent playing. Apart from controlling children, adults sometimes use parental controls on themselves.[42] The company supports this kind of protection as otherwise the potential players or their supervisors may choose to uninstall or block the game permanently.\n"
 },
 {
  "desctiption": "Intent on settling in Durotar, Thrall's Horde expanded its ranks by inviting the undead Forsaken to join orcs, tauren, and trolls. Meanwhile, dwarves, gnomes, and the ancient night elves pledged their loyalties to the Alliance, guided by the human kingdom of Stormwind. After Stormwind's king, Varian Wrynn, mysteriously disappeared, Highlord Bolvar Fordragon served as Regent but his service was affected by the mind control of the black dragon Onyxia, who ruled in disguise as a human noblewoman. As heroes investigated Onyxia's manipulations, the ancient elemental lord Ragnaros resurfaced to endanger both the Horde and Alliance.[43] The heroes of the Horde and Alliance defeated Onyxia and sent Ragnaros back to the Elemental Plane.\n"
 },
 {
  "desctiption": "Deep within Blackrock Mountain, the black dragon Nefarian conducted twisted experiments with the blood of other dragonflights. Intent on seizing the entire area for his own, he recruited the remaining Dark Horde, a rogue army that embraced the demonic bloodlust of the old Horde. These corrupt orcs, trolls, and other races battled against Ragnaros and the Dark Iron dwarves for control of the mountain. Nefarian created the twisted chromatic dragons and a legion of other aberrations in his bid to form an army powerful enough to control Azeroth and continue the legacy of his infamous father, Deathwing the Destroyer. Nefarian was vanquished by the heroes from the Horde and the Alliance.\n"
 },
 {
  "desctiption": "Years ago, in the ruined temple of Atal'Hakkar, loyal priests of the Blood God Hakkar the Soulflayer attempted to summon the wrathful deity's avatar into the world. But his followers, the Atal'ai priesthood, discovered that the Soulflayer could only be summoned within the Gurubashi tribe's ancient capital, Zul'Gurub. Newly reborn in this jungle fortress, Hakkar took control of the Gurubashi tribe and mortal champions of the trolls' mighty animal gods. The Soulflayer's dark influence was halted when the Zandalari tribe recruited heroes and invaded Zul'Gurub.\n"
 },
 {
  "desctiption": "The great desert fortress of Ahn'Qiraj, long sealed behind the Scarab Wall, was home to the insectoid qiraji, a savage race that had once mounted an assault to devastate the continent of Kalimdor. But something far more sinister lurked behind Ahn'Qiraj's walls: the Old God C'Thun, an ancient entity whose pervasive evil had suffused Azeroth since time immemorial. As C'Thun incited the qiraji to frenzy, both the Alliance and Horde prepared for a massive war effort. A mixed force of Alliance and Horde soldiers, dubbed the Might of Kalimdor, opened the gates of Ahn'Qiraj under the command of the orc Varok Saurfang. The heroes laid siege to the ruins and temples of Ahn'Qiraj and vanquished C'Thun.\n"
 },
 {
  "desctiption": "In the Lich King's haste to spread the plague of undeath over Azeroth, he gifted one of his greatest servants, the lich Kel'Thuzad, with the flying citadel of Naxxramas, as a base of operations for the Scourge. Consistent attacks from the Scarlet Crusade and Argent Dawn factions weakened the defenses of the floating fortress, enabling an incursion from the heroes that led to Kel'Thuzad's defeat. However, a traitor among the ranks of the knightly order of the Argent Dawn ran away with Kel'Thuzad's cursed remains and fled to Northrend, where the fallen lich could be reanimated.\n"
 },
 {
  "desctiption": "World of Warcraft was first announced by Blizzard at the ECTS trade show in September 2001.[44] Released in 2004, development of the game took roughly 4–5 years, including extensive testing. The 3D graphics in World of Warcraft use elements of the proprietary graphics engine originally used in Warcraft III.[44] The game was designed to be an open environment where players are allowed to do what they please.[45] Quests are optional and were designed to help guide players, allow character development, and to spread characters across different zones to try to avoid what developers called player collision.[46] The game interface allows players to customize appearance and controls, and to install add-ons and other modifications.[47]\n"
 },
 {
  "desctiption": "World of Warcraft runs natively on both Macintosh and Windows platforms. Boxed copies of the game use a hybrid CD to install the game, eliminating the need for separate Mac and Windows retail products. The game allows all users to play together, regardless of their operating system. Although there is no official version for any other platform, support for World of Warcraft is present in Windows API implementations Wine and CrossOver allowing the game to be played under Linux and FreeBSD.[48] While a native Linux client is neither released nor announced by Blizzard, in January 2011 IT journalist Michael Larabel indicated in a Phoronix article that an internal Linux client might exist but is not released due to the non-standardization of the Linux distro ecosystem.[49]\n"
 },
 {
  "desctiption": "In the United States, Canada, and Europe, Blizzard distributes World of Warcraft via retail software packages.[50] The software package includes 30 days of gameplay for no additional cost. To continue playing after the initial 30 days, additional play time must be purchased using a credit card or prepaid game card. The minimum gameplay duration that a player can purchase is 30 days using a credit card, or 60 using a prepaid game card. A player also has the option of purchasing three or six months of gameplay at once for a 6–15% discount.[51] In Australia, the United States, and many European countries, video game stores commonly stock the trial version of World of Warcraft in DVD form, which includes the game and 20 levels[52] of gameplay, after which the player would have to upgrade to a retail account by supplying a valid credit card, or purchasing a game card as well as a retail copy of the game.\n"
 },
 {
  "desctiption": "In Brazil, World of Warcraft was released on December 6, 2011 via BattleNet. The first three expansions are currently available, fully translated, including voice acting, into Brazilian Portuguese.[53]\n"
 },
 {
  "desctiption": "In South Korea, there is no software package or CD key requirement to activate the account. However, to play the game, players must purchase time credits online. There are two kinds of time credits available: one where the player is billed based on the actual number of minutes that will be available, and one where the player can play the game for a number of days. In the former, time can be purchased in multiples of 5 hours or 30 hours, and in the latter, time can be purchased in multiples of 7 days, 1 month, or 3 months.[54] As software packages are not required, expansion pack contents are available to all players on launch day.\n"
 },
 {
  "desctiption": "In China, because a large number of players do not own the computer on which they play games (e.g. if they play in Internet cafés), the CD keys required to create an account can be purchased independently of the software package. To play the game, players must also purchase prepaid game cards that can be played for 66 hours and 40 minutes.[55] A monthly fee model is not available to players of this region. The Chinese government and NetEase, the licensee for World of Warcraft in China, have imposed a modification on Chinese versions of the game which places flesh on bare-boned skeletons and transforms dead character corpses into tidy graves. These changes were imposed by the Chinese government in an attempt to \"promote a healthy and harmonious online game environment\" in World of Warcraft.[56][57] The Chinese government delayed the release of the Wrath of the Lich King expansion, due to what it deemed objectionable content.[58] NetEase took over licensing of World of Warcraft from The9 in June 2009 following the expiration of The9's contract,[59] and were able to secure a launch for Wrath of the Lich King on August 31, 2010, nearly two years after its Western release.\n"
 },
 {
  "desctiption": "The World of Warcraft launcher (referred to in press releases and the menu bar as the \"Blizzard Launcher\") is a program designed to act as a starting point for World of Warcraft players. It provides a way to launch World of Warcraft and starts the Blizzard updater. It was first included with the version 1.8.3 patch. The 2.1.0 patch allowed for an option to bypass the use of the launcher. Features of the launcher include news and updates for World of Warcraft players, access to World of Warcraft's support website, access to the test version of World of Warcraft when it is available to test upcoming patches, updates to Warden,[60] and updates to the updater itself. The 3.0.8 patch redesigned the launcher and added the ability to change the game settings from the launcher itself. The launcher update from patch 4.0.1 also allows people to play the game while non-crucial pieces of the game are downloaded. This requires a high-speed broadband internet connection.\n"
 },
 {
  "desctiption": "Patch 1.9.3 added native support for Intel-powered Macs, making World of Warcraft a universal application. As a result of this, the minimum supported Mac OS X version has been changed to 10.3.9; World of Warcraft version 1.9.3 and later will not launch on older versions of Mac OS X.[61] PowerPC architecture Macs are no longer supported since version 4.0.1.[62]\n"
 },
 {
  "desctiption": "When new content is added to the game, official system requirements may change. In version 1.12.0 the requirements for Windows were increased from requiring 256 MB to 512 MB of RAM. Official Windows 98 technical support was dropped, but the game continued to run there until version 2.2.3.[63] Before Mists of Pandaria in 2012, World of Warcraft officially dropped support for Windows 2000,[64] followed by Windows XP and Vista in October 2017, as well as all 32-bit support.[65]\n"
 },
 {
  "desctiption": "Starting with 4.3,[66] players could try out an experimental 64-bit version of the client, which required manual downloading and copying files into the installation folder. Since 5.0, the 64-bit client is automatically installed, and used by default. \n"
 },
 {
  "desctiption": "Since World IPv6 Day, the client and most of the servers support IPv6.[67]\n"
 },
 {
  "desctiption": "Eight expansions have been released: The Burning Crusade, released in January 2007; Wrath of the Lich King, released in November 2008; Cataclysm, released in December 2010; Mists of Pandaria, released in September 2012; Warlords of Draenor, released in November 2014; Legion, released in August 2016; and Battle for Azeroth, released in August 2018. Players are not required to purchase expansions in order to continue playing; however, new content and features such as higher level caps and new areas may not be available until they do so.\n"
 },
 {
  "desctiption": "Blizzard routinely applies older expansions to all accounts as new expansions are released. On June 28, 2011, The Burning Crusade expansion was automatically applied to all previous Warcraft accounts at no cost. On September 19, 2012, the same thing was done with the Wrath of the Lich King expansion,[68] and on October 15, 2013 the Cataclysm expansion was also applied.[69] On October 15, 2014, Mists of Pandaria was applied to all accounts following the release of Warlords.[70] On May 17, 2016, Warlords of Draenor was applied to all accounts to coincide with the release of the Warcraft movie that gives a 30-day trial of the game.[71]\nAll The Burning Crusade, Wrath of the Lich King, Cataclysm, Mists of Pandaria and Warlords of Draenor content is now effectively part of the original game, with all new World of Warcraft accounts automatically including these expansions upon creation.[68] As of the pre-patch release of Battle for Azeroth in July 2018, all expansions up to Legion are included in the base game.[72]\n"
 },
 {
  "desctiption": "The fifth expansion, Warlords of Draenor, was announced at BlizzCon 2013 on November 8, 2013,[73][74] and entered beta on June 27, 2014.[75] Warlords of Draenor was released on November 13, 2014.[76] On August 6, 2015, Blizzard announced the sixth expansion, Legion, at Gamescom 2015.[77] In November 2015, the Legion's alpha testing started and in April 2016 the beta test started; the Legion expansion was released on August 30, 2016. The seventh expansion, Battle for Azeroth, was released worldwide on August 13 and 14 (depending on location) 2018.[78]\n"
 },
 {
  "desctiption": "The eighth expansion, Shadowlands, was announced at BlizzCon 2019 on November 1, 2019, and brought the first \"level squish\" in the game's history, with characters at level 120 (the level cap in Battle for Azeroth) being reduced to level 50, and the new level cap being set to 60. Shadowlands was released on November 23, 2020.[79][80]\n"
 },
 {
  "desctiption": "The soundtrack for World of Warcraft was composed and arranged by Jason Hayes, Tracy W. Bush, Derek Duke, and Glenn Stafford and conducted by Eímear Noone. It was released on November 23, 2004, together with the collector's edition of the game. It is sold separately on one CD in the MP3 format. On January 12, 2011, Alfred Publishing produced an officially licensed sheet music series for vocalists, pianists, strings, and other instruments, World of Warcraft Sheet Music Anthology in solo and accompaniment formats with CD. These works include four pages of collectible artwork and vary by number of songs included. In 2018, a remix of the song from the game, \"Hymn of the Firstborn Son\", was nominated for \"Best Game Music Cover/Remix\" at the 16th Annual Game Audio Network Guild Awards.[81]\n"
 },
 {
  "desctiption": "World of Warcraft received very positive reviews upon release,[82] following a period of high anticipation before launch.[88] Although the game follows a similar model to—and was noted for using many familiar concepts from—the role-playing genre,[11][83] the new approaches to reducing pauses between game encounters were well liked.[22] A common example was the approach to character death. In some previous MMORPGs, a player would suffer a high penalty for character death; in World of Warcraft, a player is able to recover and start playing quickly.[11] Combat was another area where \"downtime\", or pauses between play, was reduced. By allowing all character types to recover from damage taken, players can return to combat quickly.[22] Reviewers felt that these changes in pacing would make the genre more accessible to casual players—those who play for short periods of time—[22] while still having \"deep\" gameplay that would attract players of all levels of interest.[21] The concept of a \"rested bonus\", or increasing the rate at which a player's character gains experience, was also welcomed as a way for players to quickly catch up with their friends in progression.[11]\n"
 },
 {
  "desctiption": "Questing was described as an integral part of the game, often being used to continue a storyline or lead the player through the game.[22] The high number of quests in each location was popular, as well as the rewards for completing them.[11] It was felt that the range of quests removed the need for a player to \"grind\", or carry out repetitive tasks, to advance their character.[21] Quests also require players to explore every section of the game world, potentially causing problems for social gamers or roleplayers seeking somewhere quiet.[22] Quests that required the player to collect items from the corpses of creatures they had killed were also unpopular; the low \"drop rate\", or chance of finding the items, makes them feel repetitive as a high number of creatures need to be killed to complete the quest.[21] A large number of new players in a particular area meant that there were often no creatures to kill,[22] or that players would have to wait and take turns to kill a particular creature to complete a quest.[11] Some critics mentioned that the lack of quests that required players to group up made the game feel as if it were designed for solo play.[85] Others complained that some dungeon or instanced group quests were not friendly to new players, and could take several hours to complete.[21] Upon release, a small number of quests had software bugs that made them impossible to complete.[11]\n"
 },
 {
  "desctiption": "Characters were felt to be implemented well, with each class appearing \"viable and interesting\", having unique and different mechanisms,[85] and each of the races having a distinct look and feel.[11] Character development was also liked, with the talent mechanism offering choice to players,[83] and profession options being praised.[11] Character customization options were felt to be low,[21] but the detail of character models was praised.[88]\n"
 },
 {
  "desctiption": "The appearance of the game world was praised by critics. Most popular was the fact that a player could run from one end of the continent to the other without having to pause at a \"loading screen\" while part of the game is retrieved from storage.[88] The environment was described as \"breathtaking\". Players found it difficult to become lost, and each area in the game world had a distinct look that blended from one to the next.[22] Critics described the environment as \"a careful blend of cartoon, fantasy art, and realism\".[83] The game was found to run smoothly on a range of computer systems,[11] although some described it as basic,[22] and mentioned that the bloom light rendering effect can blur things.[21] One reviewer described the ability to fly over long stretches of scenery as \"very atmospheric\".[85] The user interface was liked, being described as \"simple\", with tooltips helping to get the player started.[11]\n"
 },
 {
  "desctiption": "The game's audio was well received, particularly the background music. By assigning music to different areas of the game world, reviewers felt that the fantasy style added to the player's immersion,[83] and that the replay value was increased.[21] The sounds and voices used by characters and NPCs, as well as the overall sound effects, were felt to add a \"personality\" to the game.[83]\n"
 },
 {
  "desctiption": "World of Warcraft won several awards from critics upon release, including Editor's Choice awards.[11][21] In addition, it won several annual awards from the media, being described as the best game in the role-playing and MMORPG genres.[89] The graphics and audio were also praised in the annual awards, with the cartoonish style[90] and overall sound makeup being noted.[91] The game was also awarded Best Mac OS X Entertainment Product at the 2005 Apple Design Awards.[92] Computer Games Magazine named World of Warcraft the best computer game of 2004, and the magazine's Steve Bauman described his \"feeling that Blizzard has analyzed every element of every existing game, pulled out the best ones, and then lovingly lavished an absurd amount of attention to their implementation.\" It also won the magazine's \"Best Art Direction\", \"Best Original Music\" and \"Best Interface\" awards.[93]\n"
 },
 {
  "desctiption": "World of Warcraft was recognized at the 2005 Spike TV Video Game Awards where it won Best PC Game, Best Multiplayer Game, Best RPG, and Most Addictive Game.[94] In 2008, World of Warcraft was honoured—along with Neverwinter Nights and EverQuest—at the 59th Annual Technology \u0026 Engineering Emmy Awards for advancing the art form of MMORPG games.[95] GameSpot named it the best massively multiplayer game of 2004, and nominated it for the publication's \"Best Graphics, Artistic\" award.[96] In 2009, Game Informer ranked World of Warcraft 11th on their list of \"The Top 200 Games of All Time\".[97] In 2015, the game placed 3rd on USgamer's The 15 Best Games Since 2000 list.[98]\n"
 },
 {
  "desctiption": "World of Warcraft was the best-selling PC game of 2005 and 2006.[99] In the United States, it sold 1.4 million copies ($68.1 million) by August 2006. It was the country's third best-selling computer game between January 2000 and August 2006.[100] On January 22, 2008, World of Warcraft had more than 10 million subscribers worldwide, with more than 2 million subscribers in Europe, more than 2.5 million in North America, and about 5.5 million in Asia.[101] At its peak in October 2010 the game had 12 million subscribers.[102] As of November 2014 the game has over 10 million active subscribers.[103] On January 28, 2014 Blizzard announced that 100 million accounts have been created for the game.[104] On May 7, 2015, it was announced that there were 7.1 million active subscriptions.[105][106][107][108] At the end of June 2015, subscriptions dropped down to 5.6 million, lowest since 2005.[109] By the end of September, subscribers were at 5.5 million.[110]\n"
 },
 {
  "desctiption": "Less than two months after beginning operation of World of Warcraft in China on September 19, 2009, NetEase was ordered to immediately stop charging players and to cease accepting registrations.[111][112] A press estimate indicated that if World of Warcraft were shut down in China, the loss of subscribers would have caused Activision Blizzard's earnings to fall from 65 cents per share to 60 cents per share.[111] In April 2008, World of Warcraft was estimated to hold 62 percent of the MMORPG subscription market.[113] The game has grossed $9.23 billion in revenue, making it one of the highest-grossing video games of all time, along with Space Invaders, Pac-Man and Street Fighter II.[114] In early 2012, Blizzard started its own series of tournaments for World of Warcraft and Starcraft II, known as the Battle.net World Championship Series.[115][116]\n"
 },
 {
  "desctiption": "When players create World of Warcraft accounts, they are asked to choose a username and password. Afterward, whenever they play World of Warcraft, they are asked to supply the same username and password in full. This is also the case when using account management facilities online. This type of authentication is vulnerable to keystroke logging. While this is not unique to World of Warcraft and is common to many MMORPGs, the game has been directly targeted with trojans being specifically crafted to capture account login details.[117] Attacks have been reported as early as May 2006 and may extend as far back as July 30, 2005.[118] The game does, however, allow players to save their account name to the program to allow the player to only have to type their password.[119]\n"
 },
 {
  "desctiption": "In September 2006, reports emerged of spoof World of Warcraft game advice websites that contained malware. Vulnerable computers would be infected through their web browsers, downloading a program that would then relay back account information. Blizzard's account support teams experienced high demand during this episode, stating that many users had been affected. Claims were also made that telephone support was closed for isolated periods due to the volume of calls and resulting queues.[120] In April 2007, attacks evolved to take advantage of further exploits involving animated cursors, with multiple websites being used.[121][122] Security researcher group Symantec released a report stating that a compromised World of Warcraft account was worth US$10 on the black market, compared to US$6 to US$12 for a compromised computer (correct as of March 2007).[123] In February 2008, phishing emails were distributed requesting that users validate their account information using a fake version of the World of Warcraft account management pages.[124] In June 2008, Blizzard announced the Blizzard Authenticator, available as a hardware security token or mobile application[125] that provides two-factor security. The token generates a one-time password based code that the player supplies when logging on. The password, used in addition to the user's own password, is only valid for a couple of minutes, thus providing extra security against keylogging malware.[126]\n"
 },
 {
  "desctiption": "Blizzard makes use of a system known as Warden on the Windows version of the game to detect third-party programs, such as botting software, allowing World of Warcraft to be played unattended. There has been some controversy as to the legality of Warden. Warden uses techniques similar to anti-virus software to analyze other running software on the players' PCs, as well as the file system. However, unlike most anti-virus software, it sends a portion of this information back to Blizzard, which caused privacy advocates to accuse it of being spyware.[127] One example of the information Warden collects is the title of every window open on the system while WoW is running.[128] On the other hand, many gamers responded positively to the development, stating that they supported the technology if it resulted in fewer cases of cheating. Blizzard's use of Warden was stated in the Terms of Agreement (TOA).[129]\n"
 },
 {
  "desctiption": "The Warden's existence was acknowledged in March 2008, during the opening legal proceedings against MDY Industries.[130] The lawsuit was filed in federal court in Arizona, and also listed Michael Donnelly as a defendant. Donnelly was included in the suit as the creator of MMO Glider, software that can automatically play many tasks in the game. Blizzard claimed the software is an infringement of its copyright and software license agreement, stating that \"Glider use severely harms the WoW gaming experience for other players by altering the balance of play, disrupting the social and immersive aspects of the game, and undermining the in-game economy.\" Donnelly claims to have sold 100,000 copies of the $25 software.[131]\n"
 },
 {
  "desctiption": "On July 6, 2010, Blizzard Entertainment announced that on its forums for all games, users' accounts would display the real names tied to their accounts.[132] Blizzard announced the change following an agreement with Facebook to allow Facebook to connect persons who choose to become friends to share their real identity (Real ID, as Blizzard calls the feature). The integration of the feature into the forums on the Blizzard Entertainment site raised concerns amongst fans of the many game series Blizzard has created over the years.[133]\n"
 },
 {
  "desctiption": "In response to the concerns, Blizzard released an updated statement on July 9, 2010, announcing that the Real ID integration with the official forums was being canceled.[134][135]\n"
 },
 {
  "desctiption": "In addition to playing the game itself and conversing on discussion forums provided by Blizzard, World of Warcraft players often participate in the virtual community in creative ways, including fan artwork[136] and comic strip style storytelling.[137]\n"
 },
 {
  "desctiption": "Blizzard garnered criticism for its decision in January 2006 to ban guilds from advertising sexual orientation preferences. The incident occurred after several players were cited for \"harassment\" after advocating a group that was a gay-straight alliance.[138][139] Blizzard later reversed the decision to issue warnings to players promoting LGBT-friendly guilds.\n"
 },
 {
  "desctiption": "On October 7, 2010 World of Warcraft reached a subscriber base of over 12 million players.[140] Since May 2011, the number of players playing had decreased by 10% from 11.4 million to 10.3 million. Blizzard's CEO Mike Morhaime said that the reason was probably due to a drop-off in the Eastern markets.[141] In 2012, senior producer John Lagrave told Eurogamer that the drop in subscriptions may have also been attributed to the recent release of BioWare's Star Wars: The Old Republic.[142]\n"
 },
 {
  "desctiption": "As with other MMORPGs, companies have emerged offering to sell virtual gold and associated services. The practice of amassing gold and in-game items for financial profit is frequently referred to as gold farming.\n"
 },
 {
  "desctiption": "After Blizzard started offering free trial gameplay accounts, players noticed an increase in spam from bots advertising these services.[143] One study shows that this problem is particularly prevalent on the European realms, with gold being over 14 times more expensive to buy on US realms than their European counterparts.[144]\n"
 },
 {
  "desctiption": "In patch 2.1, Blizzard responded to this by adding additional anti-spam mechanics including whisper throttling and the report spam function. Additionally, trial accounts are prevented from speaking in the public chat channels (although they may speak to players within range or whisper to other players that have first whispered to them), participating in in-game trades, and using the Auction House and the mail feature, among other limitations.\n"
 },
 {
  "desctiption": "In May 2007, Blizzard filed a complaint against in Game Dollar LLC (trading as peons4hire) in U.S. federal court. In February 2008, the parties filed a consent decree in which in Game Dollar agreed to refrain from using any World of Warcraft chat or communication to advertise any business or sell any services relating to World of Warcraft.[145] In June 2007, World of Warcraft player Antonio Hernandez filed a class action lawsuit against IGE for interfering with the intended use of the game.[146]\n"
 },
 {
  "desctiption": "As characters progress in World of Warcraft and take on some of the toughest challenges, many of the rewards received are bound to that character and cannot be traded, generating a market for the trading of accounts with well-equipped characters. The highest noted World of Warcraft account trade was for £5000 (€7000, US$9,900) in early September 2007. The high price was due to the character possessing items that at the time were owned by only a handful out of the millions of active players, due to the difficulty in acquiring them. However, Blizzard banned the account five days after the purchase.[147]\n"
 },
 {
  "desctiption": "The practice of buying or selling gold in World of Warcraft has generated significant controversy.[148] On February 21, 2008, Blizzard released a statement concerning the consequences of buying gold. Blizzard reported that an \"alarmingly high\" proportion of all gold bought originates from \"hacked\" accounts. The article also stated that customers who had paid for character leveling services had found their accounts compromised months later, with all items stripped and sold for virtual gold. The article noted that leveling service companies often used \"disruptive hacks ... which can cause realm performance and stability issues\".[149] In April 2015, introduced a means to sell in-game gold for real money. A player may spend $20 on a one-month \"game time token\" that can be sold for in-game gold on the auction house.[37]\n"
 },
 {
  "desctiption": "In December 2015, Blizzard sold an in-game battle pet named Brightpaw for $10 with all proceeds going to the Make-A-Wish Foundation.[150] This resulted in a new Blizzard record donation of over $1.7 million to Make-A-Wish.[151] In December 2016, Blizzard again sold a battle pet named Mischief for $10; it helped raise more than $2.5 million for Make-A-Wish.[152] In September 2017, Blizzard sold a battle pet named Shadow the fox for $10, with proceeds going to the Red Cross to help with disaster relief.[153]\n"
 },
 {
  "desctiption": "The Corrupted Blood plague incident was one of the first events to affect entire servers. Patch 1.7 saw the opening of Zul'Gurub, the game's first 20-player raid dungeon where players faced off against a tribe of trolls. Upon engaging the final boss, players were stricken by a debuff called \"Corrupted Blood\" which would periodically sap their life. The disease was passed on to other players simply by being near infected players. Originally this malady was confined within the Zul'Gurub instance, but it made its way into the outside world by way of hunter pets or warlock minions that contracted the disease.\n"
 },
 {
  "desctiption": "Within hours, Corrupted Blood had completely infected major cities because of their high player concentrations. Low-level players were killed in seconds by the high-damage disease. Eventually, Blizzard fixed the issue so that the plague could not exist outside of Zul'Gurub.\n"
 },
 {
  "desctiption": "The Corrupted Blood plague so closely resembled the outbreak of real-world epidemics that scientists are currently looking at the ways MMORPGs or other massively distributed systems can model human behavior during outbreaks. The reaction of players to the plague closely resembled previously hard-to-model aspects of human behavior that may allow researchers to more accurately predict how diseases and outbreaks spread amongst a population.[154]\n"
 },
 {
  "desctiption": "World of Warcraft has inspired artists to satirize it and acknowledge its mark in popular culture. One example is the Emmy Award-winning South Park episode \"Make Love, Not Warcraft\".[155][156] The game has been used to advertise unrelated products, such as Toyota trucks.[157]\n"
 },
 {
  "desctiption": "In late 2007, a series of television commercials for the game began airing featuring pop culture celebrities such as Mr. T, William Shatner, and Verne Troyer discussing the virtues of the character classes they play in the game.[158] A Spanish commercial featuring Guillermo Toledo, and a French commercial featuring Jean-Claude Van Damme, were also televised.[159] Two more were shown in November 2008, featuring Ozzy Osbourne and Steve Van Zandt.[160] Another commercial in the series, which began airing in November 2011, featured Chuck Norris and played on the Internet phenomenon of \"Chuck Norris facts\".[161]\n"
 },
 {
  "desctiption": "World of Warcraft has inspired three board games: World of Warcraft: The Board Game (including Shadow of War and The Burning Crusade expansions),[162] World of Warcraft: The Adventure Game[163][164] (produced by Fantasy Flight Games), and a World of Warcraft edition of Trivial Pursuit.[165][166] There is also a trading card game,[167] and a collectible miniatures game[168] on the market, both formerly produced by Upper Deck Entertainment, now produced by Cryptozoic Entertainment. Cryptozoic released an \"Archives\" set which contains foil reproductions of older cards produced by Upper Deck.  In August 2012, Megabloks launched a licensed line of World of Warcraft 'building block' toys based on the game scenes, scenarios and characters.[169] In March 2014, Hearthstone: Heroes of Warcraft was released, which is a free-to-play digital card game based on the Warcraft universe, using classes similar to World of Warcraft.[170]\n"
 },
 {
  "desctiption": "In November 2007, DC Comics published the first issue of the World of Warcraft comic under their WildStorm imprint.[171]\n"
 },
 {
  "desctiption": "In 2015, Blizzard released Heroes of the Storm, a crossover multiplayer online battle arena video game, in which players can control over 35 heroes from Warcraft universe such as Arthas, Gul'dan, Kel'thuzad, Malfurion, Ragnaros, Sylvanas, Thrall and Varian.[172] The game features a Warcraft-themed battleground named Alterac Pass.[173]\n"
 },
 {
  "desctiption": "To mark the release of Hearthstone, Blizzard released the Hearthsteed mount for World of Warcraft players. The mount is obtained through winning three games in Arena or Play mode.[174] Widely advertised on various World of Warcraft websites, this promotion encourages World of Warcraft players to try Hearthstone and marked the first significant crossover implemented between Blizzard games.\n"
 },
 {
  "desctiption": "Players who purchase Warlords of Draenor Collector's or Digital Deluxe Edition receive an Orc themed card back in Hearthstone.[175] Heroes of the Storm players who reach level 20 receive the Grave Golem battle pet in World of Warcraft and after reaching level 100 in World of Warcraft receive an Ironside Dire Wolf mount in Heroes of the Storm.[176] Starting on March 11, 2016, players who level a character to 20 in WoW, which can be completed with the free starter edition, earn the alternate Paladin hero Lady Liadrin in Hearthstone.[177]\n"
 },
 {
  "desctiption": "Players who buy Overwatch Origins, Game of the Year, or Collectors Edition are given the Baby Winston battle pet in WoW.[178][179][180]\n"
 },
 {
  "desctiption": "On August 24, 2020, Blizzard announced that an animated series called Afterlives will premiere on August 27, during the Gamescom 2020 event.[181][182][183]\n"
 }
]